# 
#**** برمجة كائنية التوجة *****
# الكلاس هو ورقة التخطيط التي من خلالة يتم انشاء كائنات او نماذج منة

#** الكلاس لازم يكون فية حاجتان ضرورية للاوبجيكت
#1) لازم يكون فية خصائص للاوبجيكت 
#    Attributes \ الخصائص او المعلومات 

#2) لازم يكون فية وضائف للاوبجيكت
#    Methods \  الوضائف 

#**************( الفرق )********************
# الخصائص (Attributes)        
#   المديل                        
#   اللون 
#   السرعة 
#   السعر
  
#   الوضائف (Methods)
# تشغيل \ ايقاف المحرك
# غلق الصندوق \ فتح
# ايقاف الاضواء \ تشغيل
# غلق الابواب \ فتح






#** انشاء كلاس خاص عبارة عن كتاب *********
#انشاء كلاس خاص عبارة عن كتاب *********
#وضع فيه الخصائص التالية : العنوان ، المؤلف ، عدد الصفحات
class book():
    title =''
    author =''
    pages =0
    
#** انشاء كائنات من كلاس الكتاب *********
My_book =book() #انشاء كائن من كلاس الكتاب
My_book.title='Origin'   #تعيين قيمة لخاصية العنوان في الكائن
My_book.author='Dan Brown'    #تعيين قيمة لخاصية المؤلف في الكائن
My_book.pages=705     #تعيين قيمة لخاصية عدد الصفحات في الكائن


print(My_book.title)#طباعة قيمة خاصية العنوان في الكائن
print(My_book.author)#طباعة قيمة خاصية المؤلف في الكائن
print(My_book.pages)#طباعة قيمة خاصية عدد الصفحات في الكائن

#** انشاء كائن ثاني من كلاس الكتاب *********
second_book =book() #انشاء كائن ثاني من كلاس الكتاب
second_book.author='Paula Hawkins'    #تعيين قيمة لخاصية المؤلف في الكائن
second_book.title= 'Into the water'   #تعيين قيمة لخاصية العنوان في الكائن
second_book.pages= 1700              #تعيين قيمة لخاصية عدد الصفحات في الكائن

print(second_book.title)  #طباعة قيمة خاصية العنوان في الكائن
print(second_book.author)  #طباعة قيمة خاصية المؤلف في الكائن
print(second_book.pages)   #طباعة قيمة خاصية عدد الصفحات في الكائن

    













