#
#نبذة عامه على الواجهات
#اول \ كيف عمل مودجل خاص بي واستوردة 
#الفكرة العامه هي اننا نستورد اشياء معينه من مكتبات ومن مادجل كثير موجوده في بايثون 



#*** معنا مادجل مهمه في التشابتر هذا وهي مكتبة turtle *******
#يستخدم لعمل اشكال على الشاشة ورسومات تفاعلية


#نبدأ تسطيب الكود مع تشريحه وفهمه
#*******************************************

from turtle import Turtle, Screen
#تم استدعاء كلاسين مهميين وهما التالي: 
#Turtle \ بيتحكم في السلحفاة الي بتضهر على الشاشة
#Screen \ يستخدم للتحكم في النافذة الي بترتسم عليها السلحفة

sam = Turtle()
sam.shape("turtle")
sam.color("red")
sam.forward(100)
sam.left(45)
sam.forward(100)
sam.left(45)
sam.forward(100)
sam.left(45)
sam.forward(100)
sam.left(45)
sam.forward(100)
sam.left(45)
sam.forward(100)
sam.left(45)
sam.forward(100)
sam.left(45)
sam.forward(100)
window = Screen()




window.exitonclick()
#تستخدم لتثبيت النافذة على الشاشة حتى يتم الضغط عليها من قبل المستخدم



#** لمعرفة الكثير عن دوال الواجهات الرسومية اتبع التالي  **
#********** دليل المستخدم من قوقل **********
# ادخل على قوقل وابحث عن التالي 
#** (turtle module python) اضغط على الرابط الاول 