
# نوع بيانات جديد Tuple
# Tuple \ هو نوع من انواع القوائم ويشبة اللست
# Imutable : غير قابلة للتغيير

# الفرق بين Tuple AND list \ التالي
#Tuple \ يمكنك من خلالها القرائه منها وعمل كل شي الى في حالة التغيير لا يسمح
# list \ يمكنك القرائه والتعديل واضافه وحذف منها 





# مطلوب واجب انشاء شاشة بحجم 1000 * 1000 
# انشاء ثلاث رسومات داخل الشاشة
# 1. دائرة من مثلثات \ 2. دائرة من مربعات \ 3. دائرة مكرره.
# ********************************************

from turtle import Turtle, Screen # تعريف المكتبات والكلاسات


window = Screen() # تعريف اسم الواجهة وخصائصها
window.bgcolor("black") # لون الشاشة
window.setup(width=1000, height=1000)  # ابعاد الشاشة


tom = Turtle() # تعريف اول كائن من كلاس تورتل

# خصائص اول كائن
tom.shape("turtle")
tom.color("white")
tom.pensize(3)
tom.speed("fastest")



# دالة تحتوي على وضيفة تنفيذ دائرة رسومية مكرره في اسفل الشاشة
def draw_circles():
    tom.penup() # ارفع خط الرسم وانتقل الى الموقع
    tom.goto(-200,-150) # موقع وضع الرسمة
    tom.pendown() # نزل خط الرسم لتنفيذ التالي
    for _ in range(10): # فور لعدد الدوائر
        tom.circle(50) # اختصار دائرة
        tom.left(360 / 10) # قياس الدائرة
#**********************************************    



#دالة تحتوي على وضيفة عمل رسومات مربع مكرر وسط الشاشة
def draw_squares():
    tom.penup()  #ارفع خط الرسم وانتقل الى الموقع
    tom.goto(0,0) # موقع وضع الرسمة
    tom.pendown()  #  نزل خط الرسم لتنفيذ التالي
    for _ in range(10): #فور لعدد المربعات
        for _ in range(4): #فور لعدد اضلاع المربع
            tom.forward(80) #خطوة الى الامام بمقدار 80
            tom.left(90) # عمل دوران 90 درجة
        tom.left(360 / 10) # قياس الدائرة
#**********************************************
    


# دالة تحتوي على وضيفة عمل رسومات مثلث مكرر اعلى الشاشة
def draw_triangles():
    tom.penup() #ارفع خط الرسم وانتقل الى الموقع
    tom.goto(200,200) # موقع وضع الرسمة
    tom.pendown() #  نزل خط الرسم لتنفيذ التالي
    for _ in range(10): # فور لعدد المثلثات
        for _ in range(3): # فور لعدد اضلاع المثلث
            tom.forward(100) #خطوة الى الامام بمقدار 100
            tom.left(120) # عمل دوران 120 درجة
        tom.left(360 / 10) # قياس الدائرة
#**********************************************





#استدعاء الدوال الثلاثة لعمل الرسومات
draw_triangles()
draw_squares()
draw_circles()



window.exitonclick() #اغلاق الشاشة عند الضغط عليها