# في هذا الدرس سوف نتعلم كيف نبني رسالة رسوميه موجهه للمستخدمين باستخدام لغة بايثون. سنقوم بإنشاء نافذة رسومية تحتوي على رسالة ترحيبية وبعض الأزرار للتفاعل مع المستخدم.
# اولا \ الخصائص مثل الازرار وطلب ادخال من المستخدم 

# دالة تيكستقوم هذه الدالة بإنشاء نافذة رسومية تحتوي على رسالة ترحيبية وبعض الأزرار للتفاعل مع المستخدم. سنستخدم مكتبة Tkinter في بايثون لإنشاء هذه النافذة.


#** (.textinput()) \  وضيفتها تضهر رسالة ترحيبية للمستخدم وتطلب منه إدخال اسمه. بعد ذلك، يمكننا استخدام هذا الاسم في الرسالة الترحيبية.
#خصائصها الي بين القوسين
#1. title: عنوان النافذة.
#2. prompt: الرسالة التي تظهر للمستخدم لطلب إدخال اسمه. 


#** ثانيا \ يمكن ان نخلي السلحفاة بنفسها تكتب  على الشاشة 
# نستخدم دالة رايت لعرض الرسالة الترحيبية على الشاشة باستخدام السلحفاة. بعد أن يقوم المستخدم بإدخال اسمه، يمكننا استخدام هذا الاسم في الرسالة الترحيبية التي ستظهر على الشاشة.
#____.write("Hello")
#لها خصائص الي بين القوسين
#1. "Hello": النص الذي سيتم عرضه على الشاشة.
#2. move=False: إذا كانت القيمة True، فإن السلحفاة ستتحرك إلى نهاية النص بعد كتابته. إذا كانت False، فإن السلحفاة ستبقى في مكانها.
#3. align="center": محاذاة النص على الشاشة. يمكن أن تكون القيم "left" أو "center" أو "right".
#4. font=("Arial", 24, "normal"): نوع الخط وحجمه ونمطه. يمكن تغيير هذه القيم حسب الحاجة.
#5. color: لون النص. يمكن استخدام أسماء الألوان أو رموز الألوان (مثل "#RRGGBB") لتحديد اللون.
#6. speed: سرعة كتابة النص على الشاشة. يمكن أن تكون القيم من 1 (بطيء) إلى 10 (سريع).

#** دالة اخفاء السلحفاة \  بعد عرض الرسالة الترحيبية، يمكننا استخدام دالة hideturtle لإخفاء السلحفاة من الشاشة. هذا يجعل الرسالة الترحيبية تبدو أكثر وضوحًا وجاذبية للمستخدم.
#____.hideturtle()


#******************************************************************


from turtle import Turtle, Screen # تنصيب مكتبة turtle واستدعاء كلاسين مهميين وهما التالي:
#Turtle \ بيتحكم في السلحفاة الي بتضهر على الشاشة

window = Screen() #تستخدم للتحكم في النافذة الي بترتسم عليها السلحفة
sam = Turtle()    # تستخدم لإنشاء كائن سلحفاة جديد يمكننا التحكم فيه ورسم الرسومات على الشاشة.


user_name = window.textinput(title="لحضة من فضلك", prompt="ما هو اسمك؟") #هذه الدالة تقوم بإنشاء نافذة رسومية تحتوي على رسالة ترحيبية وبعض الأزرار للتفاعل مع المستخدم. سنستخدم مكتبة Tkinter في بايثون لإنشاء هذه النافذة.

sam.hideturtle() # تستخدم لإخفاء السلحفاة من الشاشة بعد عرض الرسالة الترحيبية، مما يجعل الرسالة تبدو أكثر وضوحًا وجاذبية للمستخدم.
sam.write(f"Hello, {user_name}", font=("arial", 24,"bold"), align="center") # تستخدم لعرض الرسالة الترحيبية على الشاشة باستخدام السلحفاة. بعد أن يقوم المستخدم بإدخال اسمه، يمكننا استخدام هذا الاسم في الرسالة الترحيبية التي ستظهر على الشاشة.




window.exitonclick() #تثبيت الشاشة على الشاشة حتى يتم الضغط عليها من قبل المستخدم.