

#*            (التحكم في الشاشة)        *
#***************************************
#1. معرفة التحكم في الشاشة
#2. كيفية التعامل مع كائنيين في الشاشة
#3. معرفة كيف نختصر الموضوع في البرمجة الكائنية



from turtle import Turtle, Screen  #تعريف واجهة وكلاسين
import random  #تعريف المكتبة العشوائية


window = Screen() # تعريف اسم الواجهة وخصائصها
window.bgcolor("black") # لون الشاشة
window.setup(width=800, height=800)  # ابعاد الشاشة


sam = Turtle() # تعريف اول كائن من كلاس تورتل

# خصائص اول كائن
sam.shape("turtle")
sam.color("white")
sam.pensize(2)
sam.speed("fast")


num = Turtle() # تعريف ثاني كائن من كلاس تورتل

# خصائص الكائن الثاني
num.shape("square")
num.color("orange")
num.pensize(2)
num.speed("fast")



my_angles = [0,90,180,270] # مقاسات الدوران
my_distance = [20,30,40,50,60,70,80] # عدد خطوات تحرك البكسل



#***********************************************************
#* عمل لوب واحد للكائنين مع بعض ويجعل حركتهم تسير في نفس الوقت
#* لوب محدد في عدد خطوات السير
ppp=[sam,num]

for _ in range(random.randint(20, 40)):
    for t in ppp:
        t.forward(random.choice(my_distance))
        t.left(random.choice(my_angles))


#****************************************************
#* استخدام لوب واحد لكل كائن يختلف عن الاخر وبتكرار محدد
#1. عمل حركة رسومية للكائن الاول
for _ in range(10):
    sam.forward(random.choice(my_angles))
    sam.left(random.choice(my_distance))

#2. عمل لوب لحركة الكائن الثاني 
for _ in range(10):
    num.forward(random.choice(my_angles))
    num.left(random.choice(my_distance))
#*****************************************************










#الواجب عمل دالة خاصة بالواجب التالي

#فكر في طريقة تستخدم لوب واحد فقط للكائنيين وتكون النتيجه مختلفة عن الاخرئ
#يعني المطلوب عمل لوب واحد 
# اللوب بيشتغل عدة مرات عشوائي غير محدد 
# وكملن اي سلحفة يمكنها ان تشتغل من نفس اللوب 
# لوب واحد بس يتكرر عده مرات عشوائي بيمشي خطوات طولها عشوائي بيلف بزوايا عشوائية

#***************************************************
#*   (واجب عمل لوب واحد يشتغل يحقق نتائج ل كائنيين)    *
#***************************************************

my_angles = [0,90,180,270] #مقاسات الدوران
my_distance = [20,30,40,50,60,70,80] # عدد خطوات التحرك
loop_count = [5,10,15,20] # قائمة يختار منها اللوب عشوائي لعدد الخطوات

def draw_random(turtle_name): # دالة خاصة لعمل الواجب 
    for _ in range(random.choice(loop_count)): # لوب الدوران والتحرك
        turtle_name.forward(random.choice(my_distance))  # اختيار عشوائي لعدد التحرك 
        turtle_name.left(random.choice(my_angles)) # اختيار عشوائي لعدد الدوران
        

draw_random(sam) # تنفيذ مهمة الدالة الخاصه على الكائن الاول
draw_random(num) #تنفيذ المهمه على الكائن الثاني 






window.exitonclick() # ابقئ الشاشة مفتوحه لين تضغط اي مفتاح